Autodesk.Revit.DB.ConnectorElement.FlipDirection
Reverses the direction of the connector element.
Since:
2014

Autodesk.Revit.DB.ConnectorElement.IsSystemClassificationValid(Autodesk.Revit.DB.MEPSystemClassification)
Checks that the MEPSystemType is valid for the domain of connector.
systemClassification:
The MEPSystemType to be validated.
Returns:
True if the MEPSystemType is valid for the domain of the connector, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.ConnectorElement.AssignAsPrimary
Assign a connector as a primary connector.
Remarks:
This method is used to promote this connector as primary, and the rest of connectors in this system will be assigned as secondary.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when fail to assign this connector as primary.

Autodesk.Revit.DB.ConnectorElement.CreateCableTrayConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Edge)
Create a new cable tray ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
planarFace:
The planar face to place the connector on.
edge:
One of the edges in the edge loop that defines the connector location on the planar face.
Returns:
The cable tray ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
-or-
Thrown when the edge does not belong to the face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2014

Autodesk.Revit.DB.ConnectorElement.CreateConduitConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Edge)
Create a new conduit ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
planarFace:
The planar face to place the connector on.
edge:
One of the edges in the edge loop that defines the connector location on the planar face.
Returns:
The conduit ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
-or-
Thrown when the edge does not belong to the face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2014

Autodesk.Revit.DB.ConnectorElement.CreateElectricalConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Electrical.ElectricalSystemType,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Edge)
Create a new electrical ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
electricalSystemType:
The ElectricalSystemTYpe of the connector.
planarFace:
The planar face to place the connector on.
edge:
One of the edges in the edge loop that defines the connector location on the planar face.
Returns:
The electrical ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
-or-
Thrown when the edge does not belong to the face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2014

Autodesk.Revit.DB.ConnectorElement.CreateCableTrayConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Create a new cable tray ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
planarFace:
The planar face to place the connector on.
Returns:
The cable tray ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2013

Autodesk.Revit.DB.ConnectorElement.CreateConduitConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Create a new conduit ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
planarFace:
The planar face to place the connector on.
Returns:
The conduit ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2013

Autodesk.Revit.DB.ConnectorElement.CreateElectricalConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Electrical.ElectricalSystemType,Autodesk.Revit.DB.Reference)
Create a new electrical ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
electricalSystemType:
The ElectricalSystemTYpe of the connector.
planarFace:
The planar face to place the connector on.
Returns:
The electrical ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2013

Autodesk.Revit.DB.ConnectorElement.CreateDuctConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Mechanical.DuctSystemType,Autodesk.Revit.DB.ConnectorProfileType,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Edge)
Create a new duct ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
ductSystemType:
The DuctSystemType of the connector.
profileShape:
The profile shape of the duct.
planarFace:
The planar face to place the connector on.
edge:
One of the edges in the edge loop that defines the connector location on the planar face.
Returns:
The duct ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
-or-
Thrown when the edge does not belong to the face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2014

Autodesk.Revit.DB.ConnectorElement.CreateDuctConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Mechanical.DuctSystemType,Autodesk.Revit.DB.ConnectorProfileType,Autodesk.Revit.DB.Reference)
Create a new duct ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
ductSystemType:
The DuctSystemType of the connector.
profileShape:
The profile shape of the duct.
planarFace:
The planar face to place the connector on.
Returns:
The duct ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2013

Autodesk.Revit.DB.ConnectorElement.CreatePipeConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Plumbing.PipeSystemType,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Edge)
Create a new pipe ConnectorElement with a face and an edge.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
pipeSystemType:
The PipeSystemType of the connector.
planarFace:
The planar face to place the connector on.
edge:
One of the edges in the edge loop that defines the connector location on the planar face.
Returns:
The pipe ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
-or-
Thrown when the edge does not belong to the face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2014

Autodesk.Revit.DB.ConnectorElement.CreatePipeConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Plumbing.PipeSystemType,Autodesk.Revit.DB.Reference)
Create a new pipe ConnectorElement.
Remarks:
Regenerates the document.
document:
The document to add the connector to.
pipeSystemType:
The PipeSystemType of the connector.
planarFace:
The planar face to place the connector on.
Returns:
The pipe ConnectorElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The reference is not a planar face.
-or-
document is not a family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Connector creation is not allowed in this family.
Since:
2013

Autodesk.Revit.DB.ConnectorElement.SetLinkedConnectorElement(Autodesk.Revit.DB.ConnectorElement)
Set the linked connector element.
Remarks:
Set the linked connector to null to remove the link.
otherConnector:
The connector to link to.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The connector being linked to is a different domain than that of the calling connector.
-or-
The connector being linked to is the same as the calling connector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This connector type does not support linked connectors.
Since:
2013

Autodesk.Revit.DB.ConnectorElement.GetLinkedConnectorElement
Get the linked connector element.
Returns:
The linked connector element.  If null, the connector has no link.
Since:
2013

Autodesk.Revit.DB.ConnectorElement.Direction
Gets the direction of the connector element.
Since:
2014

Autodesk.Revit.DB.ConnectorElement.SystemClassification
The system classification of the connector.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
When setting this property: The MEPSystemType is not valid for the domain of this connector.
Since:
2014

Autodesk.Revit.DB.ConnectorElement.IsPrimary
Identifies if this is the primary connector in the family.

Autodesk.Revit.DB.ConnectorElement.Radius
The radius of the connector.
Remarks: -1 if the connector is not round.

Autodesk.Revit.DB.ConnectorElement.Height
The height of the connector.
Remarks: -1 if the connector is round.

Autodesk.Revit.DB.ConnectorElement.Width
The width of the connector.
Remarks: -1 if the connector is round.

Autodesk.Revit.DB.ConnectorElement.Shape
The shape of the connector.
Remarks: ConnectorProfileType::Invalid if the connector is electrical or undefined.

Autodesk.Revit.DB.ConnectorElement.Domain
The domain of the connector.
Remarks: This property is used to retrieve the domain of the connector.

Autodesk.Revit.DB.ConnectorElement.Origin
The location of the connector in family document.

Autodesk.Revit.DB.ConnectorElement.CoordinateSystem
The coordinate system of the connector.
Remarks: The Z axis of the coordinate system is the normal to the plane of the connector.

Autodesk.Revit.DB.ConnectorElement
A base class that provides support for all connector elements occurring in families.